import React from 'react'

function AboutSindbad() {
  return (
    <section className=" ">
      <div className="max-w-5xl mx-auto">
        <h1 className="text-4xl font-bold mb-6 text-gray-800">
          عن متجر سندباد
        </h1>
        <p className="leading-relaxed text-gray-700 text-base">
          سندباد هو متجر إلكتروني حديث يقدم تجربة تسوق ذكية وسهلة، تجمع بين الراحة، السرعة، والجودة. من خلال منصة متكاملة، نتيح لك الوصول إلى مجموعة واسعة من المنتجات: من الإلكترونيات، الأزياء، مستلزمات المنزل، إلى العروض الحصرية. نحرص على تقديم أسعار تنافسية وخدمة توصيل موثوقة تغطي معظم مناطق اليمن.
          <br /><br />
          نحن نوفّر واجهة استخدام سلسة، وطرق دفع آمنة ومتعددة، مع دعم فني متجاوب لضمان تجربة تسوق مريحة وخالية من التعقيدات. سندباد لا يقتصر على كونه متجراً فقط، بل هو شريكك اليومي لتلبية احتياجاتك بخدمة راقية وموثوقة. نرحب بالجميع: أفراد، عائلات، وتجار، ونطمح لأن نكون دائماً الخيار الأول للتسوّق الإلكتروني في اليمن.
        </p>
      </div>
    </section>
  )
}

export default AboutSindbad